Revit 2027 API
BuiltInFailures.ElectricalFailures.NotPositiveBendRadius Property
 The value you entered for the bend radius is zero or a negative value. Enter a positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotPositiveBendRadius { get; }
Public Shared ReadOnly Property NotPositiveBendRadius As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotPositiveBendRadius {
	FailureDefinitionId^ get ();
}
static member NotPositiveBendRadius : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace